      *> ---------------------------------------------------------------
      *> PROGRAMME : HELLOW
      *> OBJET     : Affiche simplement le message "Hello-World" à l'écran.
      *>             Exemple de programme COBOL minimal.
      *> AUTEUR    : Vincent-cmd1
      *> REMARQUE  : Programme d’initiation à la syntaxe COBOL.
      *> ---------------------------------------------------------------

       IDENTIFICATION DIVISION.                                         
       PROGRAM-ID. HELLOW.                                       
       AUTHOR. Vincent-cmd1.                                        

       PROCEDURE DIVISION.                                             
      *> Affiche le message sur la console
           DISPLAY "Hello-World".                                  
      *> Fin normale du programme
           STOP RUN.                                                
